# -*- coding: UTF-8 -*-

# https://zhidao.baidu.com/question/555637328.html
# 用解析几何做。设两条曲线的方程分别为
# y=f(x)
# 和
# y=g(x)
# 那么两条曲线上的任意两点为x1,y1=f(x1)和x2,y2=f(x2)。两点间的距离平方为
# r²=(x1-x2)²+(y1-y2)²=(x1-x2)²+[f(x1)-g(x2)]²
# 对x1和x2求导得，
# dr²/dx1=2(x1-x2)+2[f(x1)-g(x2)]f'(x1)=0
# dr²/dx2=-2(x1-x2)-2[f(x1)-g(x2)]g'(x2)=0
# 从联立方程解出x1和x2，再用y1=f(x1)和y2=g(x2)求出y1和y2，就得到了距离最近的两点。两点间的距离由
# r²=(x1-x2)²+(y1-y2)²
# 解出
# 追问
# 对x1和x2求导得，
# dr²/dx1=2(x1-x2)+2[f(x1)-g(x2)]f'(x1)=0
# dr²/dx2=-2(x1-x2)-2[f(x1)-g(x2)]g'(x2)=0
#
# 这步怎么回事啊 理由 思路、详解 谢
# 追答
# r²=(x1-x2)²+[f(x1)-g(x2)]²
# r最小对应于(x1,y1)和(x2,y2)两点满足
# dr²/dx1=0
# dr²/dx2=0
# 这两个联立方程。
#
# dr²/dx1=d(x1-x2)²/dx1+d[f(x1)-g(x2)]²/dx1
# 第一项为
# d(x1-x2)²/dx1=2(x1-x2)
# 第二项为
# d[f(x1)-g(x2)]²/dx1=2[f(x1)-g(x2)]df(x1)/dx1=2[f(x1)-g(x2)]f'(x1)
# 所以
# dr²/dx1=2(x1-x2)+2[f(x1)-g(x2)]f'(x1)
# 同理，
# dr²/dx2=-2(x1-x2)-2[f(x1)-g(x2)]g'(x2)
# （注意负号，因为括号里的x2项和g(x2)项是负的）